<?php

return [
    'required' => 'Поле «:attribute» обязательно для заполнения.',
    'string' => 'Поле «:attribute» должно быть строкой.',
    'email' => 'Введи корректный адрес электронной почты.',
    'max' => ['string' => 'Поле «:attribute» не должно быть длиннее :max символов.'],
    'min' => ['string' => 'Поле «:attribute» должно содержать минимум :min символов.'],
    'unique' => 'Такое значение поля «:attribute» уже используется.',
    'confirmed' => 'Подтверждение поля «:attribute» не совпадает.',
    'regex' => 'Поле «:attribute» имеет неверный формат.',
    'in' => 'Выбранное значение поля «:attribute» недопустимо.',
    'current_password' => 'Неверный текущий пароль.',
    'password' => [
        'letters' => 'Поле «:attribute» должно содержать хотя бы одну букву.',
        'mixed' => 'Поле «:attribute» должно содержать строчные и заглавные буквы.',
        'numbers' => 'Поле «:attribute» должно содержать хотя бы одну цифру.',
        'symbols' => 'Поле «:attribute» должно содержать хотя бы один специальный символ.',
        'uncompromised' => 'Этот пароль найден в утечках данных. Выбери другой пароль.',
    ],
    'attributes' => [
        'name' => 'имя',
        'username' => 'ник игрока',
        'email' => 'электронная почта',
        'password' => 'пароль',
        'password_confirmation' => 'подтверждение пароля',
        'current_password' => 'текущий пароль',
        'locale' => 'язык',
        'token' => 'токен',
    ],
];
